spec/dummy/app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "file", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 19 Nov 2013 09:53:14 UTC +00:00], ["file", ""], ["title", "assadasd"], ["updated_at", Tue, 19 Nov 2013 09:53:14 UTC +00:00]]
---
  def create
    @post = Post.new(post_params)

    if @post.save